Removed unnecessary system D code
